{
  "basics": {
    "name": "Sebastian Romero Laguna",
    "label": "Software Engineer",
    "image": "",
    "email": "sebastianromerol@outlook.es",
    "phone": "",
    "url": "https://romerolweb.github.io",
    "summary": "I am Sebastian, a highly motivated and results-oriented Software Engineer (experience since 2016) enthusiast about pivoting to Cloud Infrastructure and DevOps, backed by a recent Master of Information Technology. My expertise bridges foundational software development with modern cloud and security practices. My recent Master's degree focused intensively on cybersecurity (NIST, cryptography) and cloud networking (Azure). I am seeking an opportunity to contribute my  Software Engineering skills to an Australian organisation, and I am eager to continue my professional growth in a collaborative environment.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Brisbane",
      "countryCode": "AU",
      "region": "Queensland"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "sebastian-romerol",
        "url": "https://www.linkedin.com/in/sebastian-romerol",
        "icon": "fab fa-linkedin"
      },
      {
        "network": "GitHub",
        "username": "Romerolweb",
        "url": "https://github.com/Romerolweb",
        "icon": "fab fa-github"
      },
      {
        "network": "Portfolio",
        "username": "romerolweb.github.io",
        "url": "https://romerolweb.github.io",
        "icon": "fas fa-globe"
      },
      {
        "network": "Medium",
        "username": "sebastianromerolaguna",
        "url": "https://medium.com/@sebastianromerolaguna",
        "icon": "fab fa-medium"
      },
      {
        "network": "E-mail",
        "username": "sebastianromerol",
        "url": "mailto:sebastianromerol@outlook.es",
        "icon": "fa-solid fa-envelope"
      }
    ]
  },
  "work": [
    {
      "name": "Platform Recipes",
      "position": "Software Developer",
      "url": "https://www.platform.recipes",
      "startDate": "2024-07",
      "endDate": "Present",
      "summary": "Full stack software development focusing on modern JavaScript frameworks and agile delivery.",
      "highlights": [
        "Software development using Next.js, JavaScript, and Tailwind CSS.",
        "Development of tasks under agile methodologies."
      ],
      "location": "Brisbane, Australia"
    },
    {
      "name": "Platform Recipes",
      "position": "Software Developer",
      "url": "https://www.platform.recipes",
      "startDate": "2024-06",
      "endDate": "2024-11",
      "summary": "Focused on DevOps tooling, CLI development, and infrastructure.",
      "highlights": [
        "Led the design and development of a command-line interface (CLI) application in Golang for scanning repository dependencies.",
        "Utilized SQLite for storing metadata retrieved from API queries within the CLI tool.",
        "Writing SQL queries to facilitate effective analysis of information gathered via GitHub API.",
        "Experimented with AWS EKS, AKS, GCP and Rancher for container orchestration proof-of-concepts.",
        "Created and managed Kubernetes clusters using kubectl for application deployment and scaling tests.",
        "Updated Infrastructure as Code (IaC) using Terraform blueprints to maintain current standards.",
        "Used Jira and Confluence for task management and developed Architectural Decision Records (ADR)."
      ],
      "location": "Brisbane, Australia"
    },
    {
      "name": "CQUniversity",
      "position": "Student Ambassador",
      "url": "https://www.cqu.edu.au",
      "startDate": "2024-03",
      "endDate": "Present",
      "summary": "Representing the university and guiding prospective students.",
      "highlights": [
        "Providing information and advice to prospective domestic and international students regarding CQUniversity courses.",
        "Helping students select suitable degrees by analysing their background and interests.",
        "Comparing graduate and undergraduate program structures and outcomes for prospective students.",
        "Answering student inquiries about university programs, campus life, and application processes."
      ],
      "location": "Brisbane, Australia"
    },
    {
      "name": "NEO Software Development",
      "position": "Software Engineer Lead",
      "url": "https://neosoftware.dev",
      "startDate": "2022-07",
      "endDate": "2024-03",
      "summary": "Led software strategy and development for a self-founded software services company.",
      "highlights": [
        "Led a software development team, managing project tasks and ensuring successful execution.",
        "Utilized PostgreSQL databases for managing application data storage in the cloud using RDS.",
        "Analysed product sales data using SQL queries to extract valuable business insights.",
        "Secured a competitive grant (Ecopetrol Emprende) by a national mining company for young business entrepreneurs.",
        "Spearheaded designing and implementing a comprehensive event management software solution.",
        "Delivered full-stack development projects for a US-based company, including robust REST APIs.",
        "Implemented a mentorship program for workmates focusing on business and software development."
      ],
      "location": "Colombia (Remote)"
    },
    {
      "name": "Avalanche Industries",
      "position": "Software Developer",
      "url": "",
      "startDate": "2022-01",
      "endDate": "2022-05",
      "summary": "Automation and backend development for a US-based logistics/retail company.",
      "highlights": [
        "Automated periodical data import processes from PDF to Excel, reducing manual processing time by over 4 hours per week.",
        "Developing analytical and management modules for the company's software.",
        "Implementing OAuth 2.0 authentication flows within the company's software to interact with the Amazon Seller Partner API.",
        "Conducting software maintenance, identifying and resolving bugs in in-house applications promptly.",
        "Creating comprehensive unit tests to ensure code functionality and prevent regressions.",
        "Writing SQL queries to MySQL databases for data analysis and business reporting."
      ],
      "location": "Selbyville, DE, USA (Remote)"
    },
    {
      "name": "Salisbury University",
      "position": "Data Analyst",
      "url": "https://www.salisbury.edu",
      "startDate": "2021-08",
      "endDate": "2021-12",
      "summary": "Data processing and database optimization within a university setting.",
      "highlights": [
        "Executing Extract, Transform, Load (ETL) cycles to gather and compile data from diverse sources.",
        "Cleaning, preprocessing, and compiling information from multiple sources into a single database.",
        "Ensuring data integrity and accuracy through meticulous data cleaning and validation procedures.",
        "Designing and implementing a new database structure for efficient information storage.",
        "Developing complex SQL queries to extract valuable insights tailored to diverse university community needs."
      ],
      "location": "Salisbury, MD, USA"
    },
    {
      "name": "Logical Software Factory",
      "position": "AWS Engineer (Internship)",
      "url": "",
      "startDate": "2021-09",
      "endDate": "2021-11",
      "summary": "Cloud infrastructure optimization and security implementation.",
      "highlights": [
        "Contributing to a significant reduction (over 75%) in cloud infrastructure costs by strategically implementing AWS Reserved Instances.",
        "Deploying scalable web applications onto AWS EC2 instances utilizing Docker containers.",
        "Improving application resource utilization and deployment consistency through Docker containerization.",
        "Enhancing DNS management and application scalability by leveraging AWS Route 53.",
        "Strengthening cloud environment security posture by implementing and managing robust AWS Security Group rules and Network ACLS."
      ],
      "location": "Neiva, Colombia (Remote)"
    },
    {
      "name": "Nivelics SAS",
      "position": "Back-end Developer",
      "url": "",
      "startDate": "2020-05",
      "endDate": "2020-11",
      "summary": "Backend API development and enterprise system integration.",
      "highlights": [
        "Developing and maintaining secure REST APIs, focusing on implementing encryption and decryption processes for data security.",
        "Improving internal data flow efficiency through development of REST API communications with external SAP Software.",
        "Implementing system functionalities allowing document uploads via API endpoints.",
        "Utilizing AWS services including S3 buckets for scalable object storage.",
        "Deploying and managing application components on AWS EC2 instances.",
        "Implementing AWS CodeCommit for secure Git-based version control and project management."
      ],
      "location": "Bogota, Colombia (Remote)"
    },
    {
      "name": "Cold Chain Colombia SAS",
      "position": "Software Engineering Team Lead",
      "url": "",
      "startDate": "2018-03",
      "endDate": "2020-08",
      "summary": "Led the development of CMMS platforms and digital transformation initiatives.",
      "highlights": [
        "Leading the development team responsible for creating and maintaining a real-time web and mobile platform for help desk ticket management.",
        "Overseeing the company's Computerized Maintenance Management System (CMMS) operating across web and mobile platforms.",
        "Implementing a system utilizing QR codes for efficient identification and tracking of managed machinery.",
        "Transforming raw help desk ticket data into actionable business insights through data analysis and reporting.",
        "Designing and implementing role-based access controls within maintenance platform information systems.",
        "Achievement - Systematizing maintenance reporting procedures, resulting in an 87% reduction in printed paper usage."
      ],
      "location": "Colombia"
    },
    {
      "name": "La Nación (The Nation Newspaper)",
      "position": "Web Developer",
      "url": "https://www.lanacion.com.co",
      "startDate": "2018-12",
      "endDate": "2019-12",
      "summary": "E-commerce implementation and website optimization.",
      "highlights": [
        "Developing and implementing a new e-commerce sales channel using WordPress and WooCommerce.",
        "Integrating the e-commerce platform seamlessly with existing company operational systems.",
        "Optimizing website performance through security enhancements and loading speed improvements, contributing to a documented user base increase of 2.4 million.",
        "Developing targeted landing pages for seasonal promotions, contributing to achieving over 50% growth in platform revenue.",
        "Utilizing SQL queries for performing data consultations and updates within the WordPress database instances."
      ],
      "location": "Neiva, Colombia"
    },
    {
      "name": "Freelance",
      "position": "PHP Developer",
      "url": "",
      "startDate": "2018-03",
      "endDate": "2020-06",
      "summary": "Custom web application development for various clients.",
      "highlights": [
        "Designing, developing, and maintaining custom web applications tailored to diverse client specifications using PHP and the Laravel framework.",
        "Collaborating closely with clients and cross-functional teams to ensure seamless integration of application components.",
        "Delivering high-quality, robust, and user-friendly software solutions meeting agreed requirements.",
        "Developing front-end components and interfaces using Vue.js."
      ],
      "location": "Colombia"
    },
    {
      "name": "Cold Chain Colombia SAS",
      "position": "Web Developer",
      "url": "",
      "startDate": "2017-03",
      "endDate": "2018-05",
      "summary": "Full stack development for internal maintenance systems.",
      "highlights": [
        "Transitioning company information management processes from reliance on paper and Excel spreadsheets to a centralized web-based CMMS in-house solution.",
        "Designing and developing a role-based access control (RBAC) system for the company's maintenance platform.",
        "Developing data visualization components presenting key performance indicators and adaptive graphs for CEO-level insights.",
        "Delivered web and mobile applications used by the customer, technician and management for insights delivery."
      ],
      "location": "Colombia"
    }
  ],
  "education": [
    {
      "institution": "CQUniversity",
      "url": "https://www.cqu.edu.au",
      "area": "Information Systems and Technology",
      "studyType": "Master",
      "startDate": "2023-11",
      "endDate": "2025-11",
      "courses": [
        "Networks and Information Security Major",
        "Artificial Intelligence Minor"
      ]
    },
    {
      "institution": "Fundacion Escuela Tecnologica De Neiva",
      "url": "",
      "area": "Computer Software Engineering",
      "studyType": "Bachelor of Engineering (BE)",
      "startDate": "2017-02",
      "endDate": "2021-12"
    },
    {
      "institution": "Salisbury University",
      "url": "https://www.salisbury.edu",
      "area": "Computer Science",
      "studyType": "Exchange Research Program",
      "startDate": "2021-01",
      "endDate": "2021-07",
      "courses": [
        "Focus: Machine Learning for COVID-19 Risk Factor Analysis",
        "Distinction: Participation in an International Conference"
      ]
    },
    {
      "institution": "Salisbury University",
      "url": "https://www.salisbury.edu",
      "area": "Second Language Learning",
      "studyType": "English Course (ELI)",
      "startDate": "2021-01",
      "endDate": "2021-06"
    },
    {
      "institution": "SENA - Public Institution",
      "url": "",
      "area": "Software Design",
      "studyType": "Technician (Certificate III equivalent)",
      "startDate": "2015-02",
      "endDate": "2016-09"
    }
  ],
  "certificates": [
    {
      "name": "Introduction to AWS Course: Fundamentals of Cloud Computing",
      "issuer": "AWS / Educational Provider",
      "date": "2021-01"
    },
    {
      "name": "Learning Data Science: Understanding the Basics",
      "issuer": "LinkedIn Learning / Provider",
      "date": "2021-01"
    },
    {
      "name": "Cybersecurity Diploma",
      "issuer": "Neiva’s Technological School Foundation",
      "date": "2019-01"
    },
    {
      "name": "Technologist in Software Development",
      "issuer": "Neiva’s Technological School Foundation",
      "date": "2019-01"
    },
    {
      "name": "Technician in Software Development",
      "issuer": "Neiva’s Technological School Foundation",
      "date": "2019-01"
    },
    {
      "name": "Attendance to Introduction to Data Science",
      "issuer": "Provider",
      "date": "2021-01"
    },
    {
      "name": "Work Smarter, Not Harder: Time Management for Personal & Professional Productivity",
      "issuer": "Provider",
      "date": "2021-01"
    },
    {
      "name": "Certification of Completion of The Green Zone",
      "issuer": "Provider",
      "date": "2021-01"
    }
  ],
  "awards": [
    {
      "title": "Recognised as Youth Researcher",
      "date": "2021-07",
      "awarder": "Ministry of Science in Colombia (Credly)",
      "summary": "Recognition for research participation and contribution to the scientific community."
    },
    {
      "title": "Ecopetrol Emprende Grant",
      "date": "2023-01",
      "awarder": "Ecopetrol",
      "summary": "Secured a competitive grant by a national mining-company for young business entrepreneurs to develop core business activities."
    }
  ],
  "publications": [
    {
      "name": "Machine Learning Analysis of COVID-19 Mortality Risk Factors",
      "publisher": "International Conference (Participation)",
      "releaseDate": "2021-07",
      "website": "https://github.com/Python-Neiva/risk-factors-covid19",
      "summary": "Conducted research to identify key risk factors for COVID-19 mortality in Colombia using Python and graph clustering on official public health data."
    }
  ],
  "projects": [
    {
      "name": "Cross-Platform Dependency Scanner CLI Tool",
      "description": "Developed a command-line interface (CLI) tool in Golang designed to scan documents and identify dependencies, specifically aimed at optimizing DevOps workflows and integrating with CI/CD pipelines.",
      "highlights": [
        "Engineered for high portability across macOS, Linux, and Windows.",
        "Utilized SQLite for local data storage and concurrency concepts in Golang."
      ],
      "keywords": ["Golang", "CLI", "DevOps", "Concurrency", "SQLite"],
      "url": "https://www.platform.recipes"
    },
    {
      "name": "Bakery Invoice Generator",
      "description": "Full stack invoice generation application for small businesses.",
      "highlights": [
        "Developed using Next.js, Typescript, Tailwind CSS, and SQLite.",
        "Designed clean software architecture for maintainability and internationalization.",
        "Dockerized for cloud or local deployment."
      ],
      "keywords": ["Next.js", "TypeScript", "Docker", "SQLite", "Tailwind CSS"],
      "url": "https://github.com/Romerolweb/bakery-invoice-generator"
    },
    {
      "name": "Lingua Verse",
      "description": "Language learning web application.",
      "highlights": [
        "Uses the Gemini API to provide conceptual feedback on user answers.",
        "Implemented RAG-like functionality to explain underlying concepts and correct mistakes."
      ],
      "keywords": ["Generative AI", "Gemini API", "Education Tech"],
      "url": ""
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": [
        "Golang",
        "TypeScript",
        "JavaScript",
        "Python",
        "PHP",
        "SQL",
        "HTML",
        "CSS"
      ]
    },
    {
      "name": "Cloud & DevOps",
      "keywords": [
        "AWS (EC2, S3, Route 53, Security Groups)",
        "Azure",
        "GCP",
        "Terraform",
        "Docker",
        "Kubernetes (EKS, AKS, kubectl)",
        "GitHub Actions",
        "CI/CD"
      ]
    },
    {
      "name": "Frameworks & Libraries",
      "keywords": [
        "Next.js",
        "React",
        "Node.js",
        "Laravel",
        "Vue.js",
        "Tailwind CSS"
      ]
    },
    {
      "name": "Systems & Security",
      "keywords": [
        "Linux (Ubuntu, Kali)",
        "PKI",
        "Cryptography",
        "OAuth 2.0",
        "Role-Based Access Control (RBAC)",
        "NIST"
      ]
    },
    {
      "name": "AI & Data",
      "keywords": [
        "LLMs",
        "Generative AI (Gemini, Copilot)",
        "Machine Learning (CNN, Regression, Clustering)",
        "Data Analysis",
        "ETL"
      ]
    },
    {
      "name": "Tools",
      "keywords": ["Jira", "Confluence", "Git", "Scrum", "Agile", "Draw.io"]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Full Professional"
    },
    {
      "language": "Spanish",
      "fluency": "Native or Bilingual"
    }
  ],
  "services": [
    {
      "name": "AI Integration & Workflow Automation Strategy",
      "keywords": [
        "AI Strategy",
        "Business Process Automation",
        "Technology Consulting"
      ],
      "description": "Strategic advisory for businesses looking to leverage Generative AI and automation. I assess your current workflows, identify high-impact opportunities for AI integration, and design a strategic roadmap for implementation. This includes selecting the right AI tools (like Copilot, Gemini, and other agentic systems), defining spec-driven development processes, and ensuring your team is equipped to build and maintain AI-powered solutions efficiently."
    },
    {
      "name": "Cloud-Native Architecture & Design",
      "keywords": ["Cloud Architecture", "AWS Consulting", "System Design"],
      "description": "Expert architectural design for building scalable, resilient, and cost-effective applications on AWS. I work with your team to design robust microservices architectures, define best practices for serverless computing, and create a blueprint for your cloud infrastructure that aligns with your long-term business goals and security requirements."
    },
    {
      "name": "Infrastructure as Code & CI/CD Pipeline Implementation",
      "keywords": ["DevOps Engineering", "Cloud Infrastructure", "Terraform"],
      "description": "I build and configure your complete cloud infrastructure and deployment pipelines using modern DevOps practices. This service includes writing production-grade Terraform code to manage your AWS resources and setting up automated CI/CD workflows with GitHub Actions for reliable, repeatable, and fast deployments."
    },
    {
      "name": "Custom CLI & Automation Tool Development",
      "keywords": ["Go (Golang)", "CLI Tools", "DevOps Automation"],
      "description": "Development of custom command-line interface (CLI) tools and automation scripts in Go to solve your team's specific challenges. Whether it's for automating deployments, managing infrastructure, or simplifying complex workflows, I build robust, cross-platform tools that make your engineering team faster and more effective."
    },
    {
      "name": "REST API & Microservices Implementation",
      "keywords": [
        "Backend Development",
        "Microservices",
        "Go (Golang)",
        "Python"
      ],
      "description": "Backend development focused on building secure, well-documented, and high-performance REST APIs and microservices. Using Go and modern frameworks, I implement services that are designed for scalability and maintainability, forming the backbone of your web and mobile applications. Also interested in advanced solutions using Python."
    },
    {
      "name": "Full-Stack Web Development",
      "keywords": ["Web Development", "Full-Stack", "React", "Go (Golang)"],
      "description": "End-to-end web application development using modern technologies. From front-end interfaces with React and TypeScript to robust back-end systems in Go or Python, I deliver scalable, maintainable solutions that are deployed on secure AWS infrastructure and meet your business requirements."
    }
  ],
  "meta": {
    "canonical": "https://github.com/jsonresume/resume-schema/blob/v1.0.0/schema.json",
    "version": "v1.0.0",
    "lastModified": "2025-12-10"
  }
}
